/**
  ******************************************************************************
  * @file    GCIOCtrl.c
  * @author  Duhanfneg
  * @version V1.0
  * @date    2017.10.20
  * @brief   
  ******************************************************************************
  * @attention
  * 
  * 
  * 
  * 
  ******************************************************************************
  */
   
   
/***********************************<INCLUDES>**********************************/
#include "GC_CtrlIOTable.h"
#include "../SysPeripheral/GPIO/GPIO_Man.h"


//输出IO表
GPIO_DATA m_OutputIOTable[] = 
{
    //EEROM
    {1,  24}, {1,  25}, 
    
    //LED灯
    {2,  0 }, 
    
    //输出使能脚
    {0,  22}, 
    
    //蜂鸣器
    {4,  29}, 
    
    //数码管
    {1,  30}, {1,  31}, {1,  18},
    
    //输出IO点
    {1,  23}, {1,  22}, {1,  20}, {1,  19}, {0,  29}, {0,  30}, 
    {0,  7 }, {0,  6 }, {1,  15}, {1,  14}, {1,  10}, {1,  9 },
    {1,  8 }, {1,  4 }, {2,  6 }, {2,  5 }, {2,  4 }, {2,  3 },
    {2,  2 }, {2,  1 }, {0,  9 }, {0,  8 }, {1,  1 }, {1,  0 }, 
    {0,  17}, {0,  15}, {0,  16}, {2,  9 }, {2,  8 }, {2,  7 },
    {1,  26}, {1,  28}, {1,  29}, {0,  10}, {0,  11}, {2,  10},
    
    //电磁锁
    {0,  25}, 
    
    //预留
    {0,  26}

};


//输入IO表
GPIO_DATA m_InputIOTable[] = 
{
    //按键
    {4,  28}, 
    
    //红外对射管
    {0,  18}, 
    
};


//控制IO表
const GPIO_CTRL_TABLE GC_CtrlIOTable = 
{
    m_OutputIOTable,
    m_InputIOTable,
    sizeof(m_OutputIOTable)/sizeof(GPIO_DATA),
    sizeof(m_InputIOTable)/sizeof(GPIO_DATA),
    
};

