/**
  ******************************************************************************
  * @file    main.c
  * @author  Duhanfneg
  * @version V1.0
  * @date    2017.11.07
  * @brief   
  ******************************************************************************
  * @attention
  * 
  * 通用控制平台程序入口
  * 
  * 
  ******************************************************************************
  */
  
/***********************************<INCLUDES>**********************************/
#include "../SysInit/SYS_Init.h"
#include "../Application/GC_MainProc.h"

int main(void)
{
    SYS_Init();
    GC_Init();
    
    while(1)
    {
        GC_MainProc();
        SYS_MainTaskHandler();
    }
    
} 

